app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all.includes(:author)

INSERT INTO "posts" ("body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Good!"], ["author_id", 7], ["created_at", "2016-02-01 15:01:10.178938"], ["updated_at", "2016-02-01 15:01:10.178938"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save