app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "kagura@shin.com"]]
---
  def create
    user = User.find_user_by_credentials(params[:session][:email], params[:session][:password])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
---
  def destroy
    user = User.find(params[:id])